In [1]:
%load_ext sql

In [2]:
# Remember the connection string is of the format:
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name?security=SSL
# Enter the connection string for your Db2 on Cloud database instance below
%sql ibm_db_sa://xxxx

'Connected: xxxx'

In [7]:
#Task 1
#Display the names of the unique launch sites in the space mission
%sql SELECT DISTINCT LAUNCH_SITE FROM SPACEX1;

 * ibm_db_sa://xxxxDone.

[('CCAFS LC-40',), ('CCAFS SLC-40',), ('KSC LC-39A',), ('VAFB SLC-4E',)]

In [8]:
#Task 2
#Display 5 records where launch sites begin with the string 'CCA'
%sql SELECT * FROM SPACEX1 WHERE LAUNCH_SITE LIKE 'CCA%' LIMIT 5;

 * ibm_db_sa://xxxxDone.

[(datetime.date(2010, 6, 4), datetime.time(18, 45), 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 (datetime.date(2010, 12, 8), datetime.time(15, 43), 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 (datetime.date(2012, 5, 22), datetime.time(7, 44), 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 (datetime.date(2012, 10, 8), datetime.time(0, 35), 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 (datetime.date(2013, 3, 1), datetime.time(15, 10), 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [22]:
#Task 3
#Display the total payload mass carried by boosters launched by NASA (CRS)
%sql SELECT SUM(PAYLOAD_MASS__KG_) FROM SPACEX1 WHERE CUSTOMER = 'NASA (CRS)';

 * ibm_db_sa://xxxxDone.

[(45596,)]

In [24]:
#Task 4
#Display average payload mass carried by booster version F9 v1.1
%sql SELECT AVG(PAYLOAD_MASS__KG_) FROM SPACEX1 WHERE BOOSTER_VERSION LIKE 'F9 v1.1%'

 * ibm_db_sa://xxxxDone.

[(2534,)]

In [26]:
#Task 5
#List the date when the first succesful landing outcome in ground pad was acheived.
#Hint:Use min function
%sql SELECT MIN(DATE) FROM SPACEX1 WHERE MISSION_OUTCOME='Success'

 * ibm_db_sa://xxxxDone.

[(datetime.date(2010, 6, 4),)]

In [30]:
#Task 6
#List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000
%sql SELECT DISTINCT BOOSTER_VERSION FROM SPACEX1 WHERE PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000 AND MISSION_OUTCOME='Success';

 * ibm_db_sa://xxxxDone.

[('F9 B4  B1040.2',),
 ('F9 B4 B1040.1',),
 ('F9 B5 B1046.2',),
 ('F9 B5 B1046.3',),
 ('F9 B5 B1047.2',),
 ('F9 B5 B1048.3',),
 ('F9 B5 B1051.2',),
 ('F9 B5 B1058.2',),
 ('F9 B5B1054',),
 ('F9 B5B1060.1',),
 ('F9 B5B1062.1',),
 ('F9 FT  B1021.2',),
 ('F9 FT  B1031.2',),
 ('F9 FT  B1032.2',),
 ('F9 FT B1020',),
 ('F9 FT B1022',),
 ('F9 FT B1026',),
 ('F9 FT B1030',),
 ('F9 FT B1032.1',),
 ('F9 v1.1',),
 ('F9 v1.1 B1011',),
 ('F9 v1.1 B1014',),
 ('F9 v1.1 B1016',)]

In [38]:
#Task 7
#List the total number of successful and failure mission outcomes
%sql SELECT MISSION_OUTCOME,COUNT(MISSION_OUTCOME) AS NUMBER FROM SPACEX1 GROUP BY MISSION_OUTCOME ORDER BY COUNT(MISSION_OUTCOME) DESC;

 * ibm_db_sa://xxxxDone.

[('Success', 99),
 ('Failure (in flight)', 1),
 ('Success (payload status unclear)', 1)]

In [45]:
#Task 8
#List the names of the booster_versions which have carried the maximum payload mass. Use a subquery
%sql SELECT BOOSTER_VERSION,PAYLOAD_MASS__KG_ FROM SPACEX1 WHERE PAYLOAD_MASS__KG_ IN (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEX1);

 * ibm_db_sa://xxxxDone.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2', 15600),
 ('F9 B5 B1058.3', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7', 15600)]

In [52]:
#Task 9
#List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015
%sql SELECT MONTHNAME(DATE) AS MONTH, YEAR(DATE) AS YEAR ,MISSION_OUTCOME,BOOSTER_VERSION,LAUNCH_SITE FROM SPACEX1 WHERE MISSION_OUTCOME LIKE '%Failure%' AND YEAR(DATE)='2015';

 * ibm_db_sa://xxxxDone.

[('June', 2015, 'Failure (in flight)', 'F9 v1.1 B1018', 'CCAFS LC-40')]

In [62]:
#Task 10
#Rank the count of successful landing_outcomes between the date 2010-06-04 and 2017-03-20 in descending order.
%sql SELECT COUNT(MISSION_OUTCOME) AS NUMBER, DATE FROM SPACEX1 WHERE DATE BETWEEN '2010-06-04' AND '2017-03-20' AND MISSION_OUTCOME LIKE '%Success%' GROUP BY DATE ORDER BY DATE DESC;

 * ibm_db_sa://xxxxDone.

[(1, datetime.date(2017, 3, 16)),
 (1, datetime.date(2017, 2, 19)),
 (1, datetime.date(2017, 1, 14)),
 (1, datetime.date(2016, 8, 14)),
 (1, datetime.date(2016, 7, 18)),
 (1, datetime.date(2016, 6, 15)),
 (1, datetime.date(2016, 5, 27)),
 (1, datetime.date(2016, 5, 6)),
 (1, datetime.date(2016, 4, 8)),
 (1, datetime.date(2016, 3, 4)),
 (1, datetime.date(2016, 1, 17)),
 (1, datetime.date(2015, 12, 22)),
 (1, datetime.date(2015, 4, 27)),
 (1, datetime.date(2015, 4, 14)),
 (1, datetime.date(2015, 3, 2)),
 (1, datetime.date(2015, 2, 11)),
 (1, datetime.date(2015, 1, 10)),
 (1, datetime.date(2014, 9, 21)),
 (1, datetime.date(2014, 9, 7)),
 (1, datetime.date(2014, 8, 5)),
 (1, datetime.date(2014, 7, 14)),
 (1, datetime.date(2014, 4, 18)),
 (1, datetime.date(2014, 1, 6)),
 (1, datetime.date(2013, 12, 3)),
 (1, datetime.date(2013, 9, 29)),
 (1, datetime.date(2013, 3, 1)),
 (1, datetime.date(2012, 10, 8)),
 (1, datetime.date(2012, 5, 22)),
 (1, datetime.date(2010, 12, 8)),
 (1, datetime.date(2010, 6, 4))]